; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	thermograph2 - mode
	spectrograph3 - mode
	spectrograph1 - mode
	image0 - mode
	GroundStation11 - direction
	Star12 - direction
	Star5 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation14 - direction
	GroundStation9 - direction
	Star1 - direction
	Star2 - direction
	Star13 - direction
	GroundStation10 - direction
	GroundStation8 - direction
	Star4 - direction
	Star0 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 GroundStation14)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument1 spectrograph3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation9)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 GroundStation8)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 GroundStation14)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star13)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star18)
	(supports instrument5 image0)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 Star13)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star12)
)
(:goal (and
	(pointing satellite0 GroundStation9)
	(pointing satellite3 GroundStation9)
	(have_image Planet15 spectrograph3)
	(have_image Star17 spectrograph3)
	(have_image Star18 spectrograph1)
))

)

; plan
1. (turn_to satellite1 groundstation3 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 5
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite1 planet15 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet15)
   goals met: 0 of 5
5. (turn_to satellite0 groundstation9 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 groundstation9)
   goals met: 1 of 5
6. (take_image satellite1 planet15 instrument1 spectrograph3)
   added: (have_image planet15 spectrograph3)
   goals met: 2 of 5
7. (turn_to satellite1 star17 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star17)
   goals met: 2 of 5
8. (take_image satellite1 star17 instrument1 spectrograph3)
   added: (have_image star17 spectrograph3)
   goals met: 3 of 5
9. (turn_to satellite1 star18 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 star18)
   goals met: 3 of 5
10. (take_image satellite1 star18 instrument1 spectrograph1)
   added: (have_image star18 spectrograph1)
   goals met: 4 of 5
11. (turn_to satellite3 groundstation9 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 groundstation9)
   goals met: 5 of 5
